# a = int(input("Какая температура погоды сегодня? "))
# if(a>0):
#     print("На улице тепло ☀️")
# else:
#     print("На улице холодно ❄️")   

# a = input("Введите пароль: ")
# password = "2910"
# if(a == password):
#     print("Пароль верный! ✅")
# else:
#     print("Ошибка! Неверный пароль! ❌")

# a = int(input("Введите число: "))
# if(a>100):
#     print("Ваше число:", a, "\nЧисло больше 100")
# else:
#     print("Ваше число:", a, "\nЧисло меньше 100")

    # a = int(input("Введите ваш возраст: "))
# if(a<18):
#     print(f"Вам нет 18. \nДоступ запрещён 🚫")
# else:
#     print(f"Доступ разрешён ✅")

# a = int(input("Узнать четное число или нет \nВведите число: "))
# if(a % 2==0):
#     print(f"число {a} - четное")
# else:
#     print(f"число {a} - нечетное")